Code/app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE (event_date >= '2015-02-15 23:05:00' AND event_date <= '2015-02-15 23:06:00' OR event_date = '2015-02-15 23:06:00')
SELECT "events".* FROM "events"
---
    def index
      if params[:from] != nil
        @events = Event.where("event_date >= :start_date AND event_date <= :end_date",
          {start_date: params[:from].to_datetime, end_date: params[:to].to_datetime})
      else
        @events = Event.all

SELECT STRFTIME("%Y-%m-%d %H:%M", event_date) AS date, COUNT(*) AS enters FROM "events" WHERE (event_date >= '2015-02-15 23:54:51' AND event_date <= '2015-02-16 00:00:00' AND event_type == 'enter') GROUP BY date
SELECT COUNT(*) AS count_all, EXTRACT(HOUR FROM event_date) AS extract_hour_from_event_date FROM "events" WHERE "events"."event_type" = 'enter' GROUP BY EXTRACT(HOUR FROM event_date) ORDER BY EXTRACT(HOUR FROM event_date)
SELECT COUNT(*) AS count_all, date_format(event_date, '%Y%m%d %H') AS date_format_event_date_y_m_d_h FROM "events" WHERE "events"."event_type" = 'enter' GROUP BY date_format(event_date, '%Y%m%d %H')
SELECT STRFTIME("%Y-%m-%d %H:%M", event_date) AS date, COUNT("event_type" = "enter") AS enters where "event_type" = "enter" FROM "events" GROUP BY date
---
    def summary
      if params[:from] != nil && params[:to] != nil && params[:by] != nil

        start_time = nil
        end_time = nil
        if params[:by] == 'day'
          group_hash = Event.select('STRFTIME("%Y-%m-%d", event_date) AS date, COUNT(*) AS total')
          .where("event_date >= :start_date AND event_date <= :end_date",
            {start_date: params[:from].to_datetime, end_date: params[:to].to_datetime}).group('date')

          group_hash_enter = Event.select('STRFTIME("%Y-%m-%d", event_date) AS date, COUNT(*) AS enters')
          .where("event_date >= :start_date AND event_date <= :end_date AND event_type == 'enter'",
            {start_date: params[:from].to_datetime, end_date: params[:to].to_datetime}).group('date')

SELECT "events".* FROM "events" WHERE (event_date >= '2015-02-15 00:00:00' AND event_date <= '2015-02-15 00:00:00' OR event_date = '2015-02-15 00:00:00')
---
          .where(event_type: "highfive").group('date')
        end
      else
        @events = Event.all

INSERT INTO "events" ("created_at", "event_type", "message", "otheruser", "updated_at", "user") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 15 Feb 2015 23:44:25 UTC +00:00], ["event_type", "enter"], ["message", ""], ["otheruser", ""], ["updated_at", Sun, 15 Feb 2015 23:44:25 UTC +00:00], ["user", "Alice"]]
---
    def create
      @event = Event.new(event_params)

      respond_to do |format|
        if @event.save

UPDATE "events" SET "user" = ?, "data" = ?, "updated_at" = ? WHERE "events"."id" = 1  [["user", "Alice"], ["data", Fri, 28 Feb 2014 13:00:00 UTC +00:00], ["updated_at", Sun, 15 Feb 2015 08:30:51 UTC +00:00]]
---
    def update
      respond_to do |format|
        if @event.update(event_params)